docs/arkitektur/tilstander/NAV 04-06.05.approved.md
```mermaid
   stateDiagram
   [*]-->MottattType
   	MottattType --> AvventerJournalpostType
	AvventerJournalpostType --> AvventerPersondataType
	AvventerPersondataType --> KategoriseringType
    KategoriseringType --> HåndterInnsendingType
    HåndterInnsendingType --> AventerArenaOppgaveType
    HåndterInnsendingType --> AvventerFerdigstillJournalpostType
	AventerArenaOppgaveType --> AvventerFerdigstillJournalpostType
	AvventerFerdigstillJournalpostType --> InnsendingFerdigstiltType
   InnsendingFerdigstiltType--> [*]    
```
